Repository: capstanlqc/ticket_1211_test-it_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: it_qa

source: Earth
it_qa: la Terra

source: Earth Movement
it_qa: Movimento Terra

source: Earthâ€™s axis
it_qa: Asse terrestre

source: Sun
it_qa: Sole

source: This diagram represents Earth as it rotates on its axis and orbits around the Sun (not to scale).
it_qa: Questo diagramma rappresenta la Terra mentre ruota sul suo asse e orbita attorno al Sole (non in scala).
